Revit 2024 API
AreaReinforcement.ConvertRebarInSystemToRebars Method
 Converts all RebarInSystem elements owned by the input AreaReinforcement to equivalent Rebar elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static IList<ElementId> ConvertRebarInSystemToRebars(
	Document doc,
	AreaReinforcement system
)
Visual Basic
Public Shared Function ConvertRebarInSystemToRebars ( _
	doc As Document, _
	system As AreaReinforcement _
) As IList(Of ElementId)
Visual C++
public:
static IList<ElementId^>^ ConvertRebarInSystemToRebars(
	Document^ doc,
	AreaReinforcement^ system
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 The document.
system
Type: Autodesk.Revit.DB.Structure.AreaReinforcement
 An AreaReinforcement element in the document.
Return Value
 The ids of the newly created Rebar elements.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The element system was not found in the given document. -or- system does not host Rebar.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace